In [56]:
import pandas as pd
path=r"C:\Users\dev\OneDrive\Documents\EWR_Enhanced.csv"
data=pd.read_csv(path)
df=pd.DataFrame(data)
df
# df.head() # top 5 row 
# df.tail() # bottom 5 row
# df.info() # information about data set
# df.columns
# for i in df.columns:
#     print(i)
# print(len(df))

,Order_ID,Date,Customer_Name,Customer_Age,Product,Category,Price,Quantity,Total_Sales,Discount,Final_Sales,Region,Payment_Method,Delivery_Status
0,8000,25-05-2024,Tabitha Hayes,62,Refrigerator,Home Appliances,183.62,1,183.62,41,108.34,East,Cash,Delivered
1,9337,08-02-2024,Isaac Ellis,28,Fiction,Books,41.61,3,124.83,22,97.37,West,Cash,Delivered
2,4863,14-03-2024,Kara Diaz,59,Smartphone,Electronics,127.80,9,1150.20,37,724.63,North,Credit Card,Delivered
3,2898,31-01-2024,Seth Johnson,41,Microwave,Home Appliances,48.27,2,96.54,18,79.16,West,UPI,Returned
4,2369,20-07-2024,Angelica Banks,29,Washing Machine,Home Appliances,236.21,3,708.63,19,573.99,South,Debit Card,Pending
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,7287,16-09-2024,John Fisher,40,Refrigerator,Home Appliances,75.15,2,150.30,23,115.73,South,Credit Card,Pending
496,4049,22-06-2024,Travis Mckay,34,Refrigerator,Home Appliances,185.91,4,743.64,37,468.49,West,Cash,Pending
497,8820,22-06-2024,Jonathan Gillespie,45,Perfume,Beauty,192.16,10,1921.60,28,1383.55,East,Cash,Pending
498,9207,18-09-2024,Leroy Carpenter,30,Lipstick,Beauty,488.95,2,977.90,15,831.21,North,Debit Card,Delivered
499,5757,08-09-2024,NaN,26,Moisturizer,Beauty,148.27,1,148.27,9,134.93,West,Credit Card,Delivered

In [ ]:
# Methods of column selection.
# 1.list based
# 2.label based
# 3.indexed(integer based)

In [54]:
import pandas as pd
path=r"C:\Users\dev\OneDrive\Documents\EWR_Enhanced.csv"
data=pd.read_csv(path)
df=pd.DataFrame(data)
# df[['Customer_Name','Payment_Method']]
df.iloc[:,[0,1]]

     Order_ID        Date
0        8000  25-05-2024
1        9337  08-02-2024
2        4863  14-03-2024
3        2898  31-01-2024
4        2369  20-07-2024
..        ...         ...
495      7287  16-09-2024
496      4049  22-06-2024
497      8820  22-06-2024
498      9207  18-09-2024
499      5757  08-09-2024

[500 rows x 2 columns]

In [38]:
# How to load data in mysql from pandas using connectivity.
import random
import pandas as pd
import mysql.connector
from faker import Faker
fake=Faker()
fake_name=[fake.name() for name in range(4)]
random_salary=[random.randrange(40000,80000) for s in range(4)]
# print(random_salary)
# print(fake_name)

df = pd.DataFrame({
    "id":[i for i in range(100,200)],
    "name":fake_name,
    "salary":random_salary,
})

# create_table="""
#         CREATE TABLE IF NOT EXISTS PANDAS (ID INT , NAME VARCHAR(100), SALARY BIGINT);
#         """
#         agent.execute(create_table)

insert_query="""
        INSERT INTO PANDAS (ID,NAME,SALARY)
        VALUES(%s, %s, %s)
"""

# print(df.to_numpy())
with mysql.connector.connect(
    host="localhost",
    user="root",
    password="root@123",
    database="batch_100"
) as agent:

    with agent.cursor() as cursor:
        data=[tuple(row) for row in df.to_numpy()]
        cursor.executemany(insert_query,data)
        agent.commit()
        print(f"{cursor.rowcount} row inserted..")
df

[51577, 73628, 76103, 62512]
['Erin Davis', 'Megan Thompson', 'Laura Kemp', 'John Ramos']
4 row inserted..

   id            name  salary
0   1      Erin Davis   51577
1   2  Megan Thompson   73628
2   3      Laura Kemp   76103
3   4      John Ramos   62512

In [35]:
from faker import Faker
fake=Faker()
fake_name=[fake.name() for name in range(4)]
print(fake_name)

['Kevin Davis', 'Jessica Stone', 'Miguel Murphy', 'Derek Washington']

In [37]:
import random
random_salary=[random.randrange(40000,80000) for s in range(4)]
print(random_salary)

[66406, 63497, 62626, 40873]